In [1]:
import pandas as pd
import sqlalchemy as db
from sqlalchemy import text
import pandas as pd

In [3]:
engine = db.create_engine("mysql://root:root@172.16.5.4:3310/dw_netflix")
conn = engine.connect()

In [4]:
df_fact = pd.read_sql('SELECT * from FactWatchs', con=conn)
df_fact.head()

    userID   movieID  rating           timestamp
0  1002331  80210920     2.0 2024-03-29 20:43:48
1  1002331  80192187     4.3 2024-02-07 15:58:13
2  1002331  81157374     1.5 2024-03-07 17:27:35
3  1002332  80210920     4.8 2024-02-28 20:36:28
4  1002332  80192187     1.6 2024-03-17 19:53:21

In [5]:
df_user = pd.read_sql('SELECT * from dimUser', con=conn)
df_user.head()

    userID     username    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [6]:
df_movie = pd.read_sql('SELECT * from dimMovie', con=conn)
df_movie.head()

,movieID,title,releaseMovie,gender,participantName,roleparticipant,awardMovie
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,Grammy

In [22]:
# Rating por pelicula
# Experimento 1
# Este retorna una serie
promedio_movies_test = df_fact[['movieID', 'rating']].groupby('movieID').sum()/\
                df_fact[[ 'movieID', 'rating']].groupby('movieID').count()
promedio_movies_test

          rating
movieID
80192187   2.945
80210920   2.815
81157374   2.495

In [24]:
# Rating por pelicula
# Experimento 2
# Este retorna un dataframe
promedio_movies = df_fact.groupby('movieID')['rating'].mean()
promedio_movies = promedio_movies.reset_index()
promedio_movies

    movieID  rating
0  80192187   2.945
1  80210920   2.815
2  81157374   2.495

In [25]:
# Rating por usuario
# Este retorna un dataframe
promedio_user = df_fact.groupby('userID')['rating'].mean()
promedio_user = promedio_user.reset_index()
promedio_user

      userID    rating
0    1002331  2.600000
1    1002332  2.500000
2    1002333  1.800000
3    1002334  2.633333
4    1002335  2.200000
5    1002336  3.433333
6    1002337  2.666667
7    1002338  2.533333
8    1002339  2.833333
9   10023310  3.033333
10  10023311  2.866667
11  10023312  3.266667
12  10023313  2.433333
13  10023314  2.766667
14  10023315  2.333333
15  10023316  2.133333
16  10023317  2.800000
17  10023318  1.533333
18  10023319  4.066667
19  10023320  4.600000

In [27]:
df_fact.head()

    userID   movieID  rating           timestamp
0  1002331  80210920     2.0 2024-03-29 20:43:48
1  1002331  80192187     4.3 2024-02-07 15:58:13
2  1002331  81157374     1.5 2024-03-07 17:27:35
3  1002332  80210920     4.8 2024-02-28 20:36:28
4  1002332  80192187     1.6 2024-03-17 19:53:21

In [28]:
df_user.head()

    userID     username    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [33]:
# Calcular el promedio de rating por usuarios premium
# Experimento 1
filtered_df_user = df_user[df_user['subscription'] == "Premium"]
user_fact_merged = df_fact.merge(filtered_df_user, on="userID")
promedio_user_fact = user_fact_merged.groupby('userID')['rating'].mean()
promedio_user_fact = promedio_user_fact.reset_index()
promedio_user_fact.head()

    userID    rating
0  1002331  2.600000
1  1002333  1.800000
2  1002335  2.200000
3  1002337  2.666667
4  1002339  2.833333

In [35]:
# Calcular el promedio de rating por usuarios premium
# Experimento 2
promedio_user_fact_test = df_fact\
    .merge(df_user.query("subscription == 'Premium'"), on='userID')\
    .groupby('userID')['rating'].mean()
promedio_user_fact_test.head()

userID
1002331    2.600000
1002333    1.800000
1002335    2.200000
1002337    2.666667
1002339    2.833333
Name: rating, dtype: float64